tutorial_cases/OF9/airlift_40m/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingTwoPhaseEulerFoam;

startFrom       latestTime; //startTime; //latestTime

startTime       0;

stopAt          writeNow;//endTime;

endTime         500;

deltaT          0.00025;

writeControl    adjustableRunTime;

writeInterval   1.0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.3;

maxDeltaT       1;

functions
{

    #includeFunc    writeObjects(d.gas)
    #includeFunc    writeObjects(thermo:rho.gas)
    #includeFunc    writeObjects(thermo:rho.liquid)
    #includeFunc    writeObjects(thermo:mu.liquid)
    #includeFunc    writeObjects(thermo:mu.gas)

}
//functions
//{
//    #includeFunc fieldAverage(U.air, U.water, alpha.air, p)
//}


/*functions
{
    writeFields
    {
        type writeRegisteredObject;
        functionObjectLibs ( "libIOFunctionObjects.so" );
        objectNames ("thermo:rho.liquid");
        objectNames ("thermo:rho.gas");
        outputControl     outputTime;
    }
}*/


// ************************************************************************* //
