tutorial_cases/OF9/airlift_40m/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/globalVars"

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species
(
    H2O
    O2
);

defaultSpecie H2O;

"(mixture|H2O)"
{
    specie
    {
        nMoles      1;
        molWeight   18;
    }
    equationOfState
    {
        rho        $rho0MixLiq;
    }
    thermodynamics
    {
        Hf          -15857343;
        Cp          $CpMixLiq;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrMixLiq;
    }
}

//CO2
//{
//    specie
//    {
//        nMoles      1;
//        molWeight   44;
//    }
//    equationOfState
//    {
//        R           $RMixLiq;
//        rho0        $rho0MixLiq;
//    }
//    thermodynamics
//    {
//        Hf          -9402451;
//        Cp          $CpMixLiq;
//    }
//    transport
//    {
//        mu          $muMixLiq;
//        Pr          $PrMixLiq;
//    }
//}

// N2
// {
//     specie
//     {
//         nMoles      1;
//         molWeight   28;
//     }
//     equationOfState
//     {
//         R           $RMixLiq;
//         rho0        $rho0MixLiq;
//     }
//     thermodynamics
//     {
//         Hf          0;
//         Cp          $CpMixLiq;
//     }
//     transport
//     {
//         mu          $muMixLiq;
//         Pr          $PrMixLiq;
//     }
// }

O2
{
    specie
    {
        nMoles      1;
        molWeight   32;
    }
    equationOfState
    {
        rho        $rho0MixLiq;
    }
    thermodynamics
    {
        Hf          -365639;
        Cp          $CpMixLiq;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrO2;
    }
}
// ************************************************************************* //
